import { Member } from "@/app/types/member.types";

export const FRONT_MEMBERS: Member[] = [
  {
    name: "최서연",
    univ: "홍익대학교",
    major: "컴퓨터공학과",
    description:
      "UX를 중시하고 아이디어가 나오면 기능 구체화하는 걸 좋아하는 편입니다.",
  },
  {
    name: "한서정",
    univ: "이화여자대학교",
    major: "컴퓨터공학과",
    description:
      "열정과 도전, 저를 설명할 때 빠질 수 없는 단어입니다. 호기심이 많은 저는, 제가 좋아하는 분야에 대해서 끊임 없이 탐구합니다!",
  },
  {
    name: "원채영",
    univ: "홍익대학교",
    major: "컴퓨터공학과",
    description:
      "협업 과정에서 팀 분위기와 흐름을 잘 파악하려 노력하고, 분위기가 처질 땐 유머러스하게 풀어가며, 문제를 마주했을 땐 진지하게 집중해 함께 해결해 나갑니다.",
  },
  {
    name: "신수진",
    univ: "홍익대학교",
    major: "컴퓨터공학과",
    description:
      "협업을 중시하며, 편안한 분위기 속에서 적극적인 소통과 피드백을 이끌어내는 능력을 갖추고 있습니다.",
  },
  {
    name: "김철흥",
    univ: "홍익대학교",
    major: "컴퓨터공학과",
    description:
      "저의 힘으로 주변 사람들을 돕는 것을 좋아합니다! 재밌는 분위기 속에서 같이 즐기면서 일하는 것을 좋아하고, 분위기 메이커의 역할을 할 수 있다고 생각해요!",
  },
  {
    name: "송아영",
    univ: "홍익대학교",
    major: "컴퓨터공학과",
    description:
      "디자인과 개발 사이, 데이터와 렌더링 사이, 그 괴리 안에서 소통을 바탕으로 타협점을 찾아가는 프론트엔드 개발자입니다.",
  },
  {
    name: "김영서",
    univ: "이화여자대학교",
    major: "컴퓨터공학과",
    description: "시각적 소통 중시, 긍정적 태도, 책임감",
  },
  {
    name: "이주희",
    univ: "홍익대학교",
    major: "컴퓨터공학과",
    description:
      "주어진 목표를 끝까지 해결하며, 프로젝트가 완성된 이후에도 지속적으로 개선하고 운영하는 것을 중요하게 생각합니다.",
  },
  {
    name: "김서연",
    univ: "이화여자대학교",
    major: "컴퓨터공학과",
    description:
      "매일매일 공부하고, 실습하며 나아가요. 어제보다 더 나은 코드를 만들어 가며 가장 큰 보람을 느껴요!",
  },
  {
    name: "김동욱",
    univ: "연세대학교 일반대학원",
    major: "인공지능학과",
    description: "멋진 프론트엔드 개발자입니다.",
  },
] as const;

export const BACK_MEMBERS: Member[] = [
  {
    name: "최근호",
    univ: "홍익대학교",
    major: "컴퓨터공학과",
    description:
      "제가 가진 논리력이 코드로 풀어지고, 코드가 하나의 제품으로 뭉쳐지는 이 과정을 좋아합니다. 만들어낸 제품이 생명체처럼 실제 사람들에게 영향을 줄 수 있다는 사실이 뿌듯하고 즐겁습니다!",
  },
  {
    name: "이석원",
    univ: "연세대학교",
    major: "기계공학과",
    description:
      "프론트엔드 경험도 있기 때문에 프론트엔드와 원활한 소통이 가능합니다!",
  },
  {
    name: "박서연",
    univ: "홍익대학교",
    major: "컴퓨터공학과",
    description:
      "새로운 도전에 두려움이 없으며, 빠르게 배우고 적응하는 능력을 갖추고 있습니다! 백엔드 개발과 ML 엔지니어링에 깊은 관심을 가지며, 열정적으로 탐구하고 성장하고 있습니다.",
  },
  {
    name: "박채연",
    univ: "홍익대학교",
    major: "컴퓨터공학과",
    description:
      "맡은 역할은 꼭 해내기 위해 노력하는 성격입니다. 새로운 것을 배우는 것에 보람을 느낍니다!",
  },
  {
    name: "김준형",
    univ: "홍익대학교",
    major: "컴퓨터공학과",
    description:
      "개발자가 되기로 결심한 그 순간처럼 설레는 개발을 하며 여러분과 함께 목표를 향해 나아가는 경험을 즐기고 싶습니다.",
  },
  {
    name: "임도현",
    univ: "홍익대학교",
    major: "컴퓨터공학과",
    description:
      "한 번 시작하면 완벽히 해낼 때까지 절대 포기하지 않는 끈기를 가지고 있습니다. MBTI INFJ 중 J가 항상 90% 이상이 나올 정도로 해야 할 일은 계획대로 미리 해야 하는 성격입니다.",
  },
  {
    name: "박정하",
    univ: "홍익대학교",
    major: "컴퓨터공학과",
    description:
      "맡은 역할에 대해서 어떤 일이 있어도 최선을 다해 책임을 다할 것을 자부합니다!!! 또한, 저는 낙오되는 사람 없이 끝까지 함께 나아갈 수 있는 팀을 만들 자신이 있습니다.",
  },
  {
    name: "서채연",
    univ: "홍익대학교",
    major: "컴퓨터공학과",
    description:
      "새로운 도전에 대한 두려움보다 호기심을 느끼고 이런 성향을 바탕으로 계속해서 성장하고자 합니다!",
  },
  {
    name: "오지현",
    univ: "홍익대학교",
    major: "컴퓨터공학과",
    description:
      "공유 및 소통의 필요성을 아는 유연한 사람입니다. mbti는 ENFJ! J의 특성을 잘 보이는 계획수립자입니다. 새로운 것을 빠른 반복을 통해 익히는 편입니다.",
  },
  {
    name: "한혜수",
    univ: "홍익대학교",
    major: "컴퓨터공학과",
    description:
      "여러 기술을 접해봤고, 이를 통해 세상을 보는 눈이 더 유연해 졌어요! 백엔드 뿐만 아니라 여러 분야에 관심이 많고 공부하는 것을 좋아해요",
  },
] as const;
